var json_reprojected_archreprojected_1 = {
    "type": "FeatureCollection",
    "name": "reprojected_archreprojected_1",
    "crs": {
        "type": "name",
        "properties": {
            "name": "urn:ogc:def:crs:OGC:1.3:CRS84"
        }
    },
    "features": [{
        "type": "Feature",
        "properties": {
            "fid": "3",
            "id": "4645645",
            "nn": 13.0,
            "img": "images/image43.jpg",
            "name": "Дом-коммуна, ул. Конёнкова, д.9-а",
            "descr": "Дом Парижской коммуны в Смоленске — символ конструктивизма и утопии коллективного быта 1930-х годов. Первая городская многоэтажка, когда-то считавшаяся «небоскрёбом», быстро стала легендой: отсутствие удобств, трагическая судьба архитектора Олега Вутке и мистическая история места сделали её культовым объектом. Сегодня полуразрушенный «Чайник» остаётся редким памятником конструктивистской эпохи и напоминает о смелых, но противоречивых экспериментах советской архитектуры."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.049002403351984, 54.785467358546882]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "4",
            "id": "453453",
            "nn": 11.0,
            "img": "images/image45.jpg",
            "name": "Дом Будникова, ул. Коммунистическая, д.1",
            "descr": "На перекрестке улиц Коммунистической и Маяковского в Смоленске возвышается величественное здание, ставшее неотъемлемой частью городского пейзажа и исторического наследия. Это архитектурное произведение, возведенное в 1895-96 годах по заказу купца П.А. Будникова, представляет собой неорусский стиль, который заявил о себе как поиск национальной архитектурной идентичности во времена, когда преобладали европейские тенденции."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.049086885488023, 54.780819991083263]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "5",
            "id": "43534553",
            "nn": 1.0,
            "img": "images/image22.jpg",
            "name": "Пожарное депо, каланча и каретный сарай, ул. Глинки, д.(2, 2А)",
            "descr": "Бывший комплекс пожарного депо, хоть и спрятан в глубине квартала, представляет собой уникальный архитектурный ансамбль, олицетворяющий тысячелетнюю историю города. Восстановленный после разрушений во время войны, он сохранил свою первозданную красоту, став привлекательным объектом для горожан и туристов. Его кирпичный стиль с элементами классицизма украшает центр города, напоминая о разнообразии российской архитектуры XX века."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.048270121579904, 54.779757243154904]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "7",
            "id": "78778",
            "nn": 10.0,
            "img": "images/image60.jpg",
            "name": "Дом героев Железного потока, ул. Коммунистическая, д.5",
            "descr": "Здание в стиле конструктивизма было построено в Смоленске в 1932 году по проекту архитектора А.Ф. Зимницкого, по его же проекту дом был восстановлен в 1949-1950-х годах. Этот четырехэтажный кирпичный дом с полуподвалом на бутовом фундаменте является прекрасным образцом архитектурного стиля конструктивизма, который характеризуется строгими и ясными объемами, а также оштукатуренными поверхностями."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.050324059886762, 54.780831266318657]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "8",
            "id": "43543535",
            "nn": 17.0,
            "img": "images/image31.jpg",
            "name": "Дом купца Тураева, ул. Воровского, д. 24",
            "descr": "Дом купца Тураева на пер. Воровского, 24 — редкий уцелевший фрагмент застройки Смоленска конца XIX – начала XX века. Построенный во 2-й половине XIX века, он сочетает элементы эклектики и классических мотивов: побеленные кирпичные стены, декоративные фризы, арочные окна и вход с двускатным козырьком на изящных кронштейнах. Здесь с 1903 по 1909 год жил известный историк и краевед И. И. Орловский. Дом, переживший разрушения войны, сегодня признан памятником регионального значения и нуждается в реставрации."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.042039388175006, 54.785922205899162]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "9",
            "id": "43534543",
            "nn": 9.0,
            "img": "images/image16.jpg",
            "name": "Лютеранская кирха, ул. Ленина, д.12",
            "descr": "Здание кирхи является не только архитектурным символом города, но и важным свидетельством исторических событий и культурного развития Смоленска. Ее архитектурный облик отражает не только религиозные аспекты, но и влияние различных архитектурных течений на формирование городской среды. Сама кирха является частью архитектурного комплекса, включающего в себя также дома-причты, которые дополняют ее облик. Этот комплекс архитектуры формировался в разные исторические периоды, что придает ему многослойность и уникальность."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.050737335265119, 54.782217188201791]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "10",
            "id": "454353",
            "nn": 10.0,
            "img": "images/image59.jpg",
            "name": "Дом профсоюзов, ул. Ленина, д.13А",
            "descr": "Дом Профсоюзов является единственным представителем советского модернизма в центре  Смоленске. Он сочетает в себе элементы брутализма, конструктивизма и модернизма, выделяясь на фоне исторической застройки города. Он вызывает неоднозначные чувства у горожан, но является символом времени и исторической динамики архитектурного развития Смоленска. Такие архитектурные артефакты являются важными объектами для исследования и сохранения, напоминая о советской эпохе и обогащая архитектурное наследие города."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.051460944410529, 54.783185642830361]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "11",
            "id": "34534534",
            "nn": 7.0,
            "img": "images/image13.jpg",
            "name": "Дом Павлова, ул. Большая Советская улица, д.12/1",
            "descr": "Дом Павлова в Смоленске, построенный купцом Григорием Павловым, стал важной частью городской истории. Первоначально двухэтажный особняк с магазином модных товаров был расширен до трёх этажей и считался одним из лучших торговых мест города. После революции здание сменило назначение, превратившись в центр культурной и образовательной жизни — Дом работников просвещения, а позже Дом учителя. В 1955 году его восстановили после разрушений войны и открыли здесь Дом книги — крупнейший книжный магазин и литературную площадку города, где выступали Твардовский, Исаковский и другие известные писатели. Сегодня Дом книги сохраняет статус архитектурного памятника и культурного символа Смоленска."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.053192054903285, 54.784250464135305]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "13",
            "id": "675765",
            "img": "images/image39.jpg",
            "nn": 15.0,
            "name": "Дом жилой, ул. Карла Маркса, д.14",
            "descr": "Выдающийся образец модерна в Смоленске поражает гармоничным сочетанием изящных форм, богатого декоративного оформления и продуманной планировки. Здание, построенное в конце XIX – начале XX века, отражает дух эпохи, когда архитекторы стремились соединить эстетику природных линий и мотивов с новыми технологиями и материалами. Его фасад с ризалитами, фронтоном и изысканными барельефами создаёт неповторимый облик. Сегодня это здание является не только важным памятником архитектурного наследия региона, но и одним из символов культурного развития Смоленска, привлекающим внимание ценителей истории и искусства."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.042198809379336, 54.782858001372624]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "14",
            "id": "453454",
            "img": "images/image46.jpg",
            "nn": 3.0,
            "name": "Дом купцов Волковых, ул. Большая Советская, д. 43",
            "descr": "43 дом по Большой Советской улице – образец архитектуры, в которой переплелась эклектика и классицизм с неорусским стилем. Эта принадлежность читается в оформлении аркатуры, обрамляющей большие окна второго этажа. Схожую стилистику встречаешь в русском зодчестве до эпохи Петра 1, который изменил курс на европейские визуальные образы, прекратив поиски русской идентичности через искусство и архитектуру."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.052103024609671, 54.779663293694377]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "15",
            "id": "342342",
            "nn": 4.0,
            "img": "images/image5.jpg",
            "name": "Дом жилой, ул. Большая Советская, д. 20\n",
            "descr": "Этот дом, построенный в 1912 году, является представителем модернового стиля в Смоленске. Его автором был архитектор Николай Запутряев, который оставил после себя еще множество примечательных зданий в городе. Дом №20 отличается не только внешним оформлением, но и уникальной внутренней планировкой: на нижних этажах размещались магазины и заведения общепита, а верхние этажи предназначались для жилых помещений."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.052585732993201, 54.782158812829735]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "16",
            "id": "3432424",
            "img": "images/image2.jpg",
            "nn": 6.0,
            "name": "Конторское здание, ул. Большая Советская, д.21",
            "descr": "Это компактное трехэтажное здание на Большой Советской улице — яркий пример сочетания эклектики и модерна. Его выразительный фасад с эркером, балконом, лепными вазонами и стилизованными кокошниками выделяется на фоне застройки и демонстрирует богатство декоративных деталей, отсылающих к русским архитектурным традициям и эстетике начала XX века."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.053791743267915, 54.783646901205969]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "17",
            "id": "34234",
            "img": "images/image1.jpg",
            "nn": 16.0,
            "name": "Доходный дом, ул. Карла Маркса, д.12а",
            "descr": "Дом 12а, построенный в 1911 году, стал заметным примером неоклассицизма в архитектуре Смоленска. Автор проекта — выдающийся архитектор Виктор Александрович Коссов (1840–1917), академик архитектуры, основатель Петербургского общества архитекторов и участник строительства Храма Христа Спасителя в Москве. Коссов известен проектами пассажей, доходных домов и особняков в Москве, а также лютеранского собора Петра и Павла. Конфликт вокруг досрочной штукатурки фасада, вызвавший споры с губернским инженером А.Т. Богдановичем, лишь подчеркнул необычность и значимость этого здания."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.042638273112622, 54.783361212206074]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "18",
            "id": "345345",
            "nn": null,
            "name": null
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": []
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "19",
            "id": "35235",
            "img": "images/image17.jpg",
            "nn": 14.0,
            "name": "Епархиальное училище, ул. Пржевальского, д.4",
            "descr": "Смоленское женское епархиальное училище было основано в 1852 году при Вознесенском монастыре. Первоначальное здание со временем стало непригодным, и в 1895–1900 годах построили новый корпус — одно из крупнейших зданий Смоленска того времени. Архитектура выполнена в стиле эклектики, при училище действовала домовая церковь Введения во храм Пресвятой Богородицы. Здание с П-образным планом выходит южным фасадом на улицу Пржевальского. Центральный ризалит, завершённый пологим щипцом с пятиугольным окном и машикулями, выделяется богатым декором. Внутри располагается вестибюль, за которым проходит сводчатый коридор с крестовыми сводами в угловых частях. Главный акцент интерьера — широкая раздваивающаяся лестница с арочными проёмами, оригинальной решёткой и литым рельефным ограждением."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.046221938887989, 54.784263252417347]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "20",
            "id": "45345",
            "nn": 12.0,
            "img": "images/image25.jpg",
            "name": "Дом с башней, ул. Ленина, д.7/2",
            "descr": "Построенное в 1954 году, здание отличается своей уникальностью архитектурных деталей. Архитектором этого проекта был Виталий Бухтеев, который также разработал дом на улице Октябрьской Революции под номером 4а, создавая визуальную гармонию в пешеходном центре Смоленска. Здание выполнено в стиле сталинского ампира, объединяющего элементы русской классики, барокко и романтизма, что придает ему узнаваемость и привлекательность. Фасады дома богато украшены барельефами с символикой советского государства и коммунизма, включая серп и молот."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.04904467233473, 54.782625516126402]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "21",
            "id": "54346",
            "nn": 2.0,
            "img": "images/image42.jpg",
            "name": "Гостиница «Смоленск», ул. Глинки, д.11/30",
            "descr": "Архитектурное значение здания бывшей гостиницы «Смоленск» не ограничивается только его исторической значимостью, но и в стилистическом слиянии представляет переход от дореволюционного неоклассицизма к сталинскому ампиру. Созданный выдающимися архитекторами Борисом Великовским и Ильей Голосовым отель является свидетельством их влияния, сочетая в себе классические элементы с авангардными концепциями. Наследие Великовского в предреволюционном неоклассическом дизайне проявляется в великолепии и симметрии отеля, напоминающих престижные сооружения Москвы, такие как дом-апартаменты А. И. Меркулова."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.051329449759073, 54.779657288522088]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "22",
            "id": "43534543",
            "nn": 5.0,
            "img": "images/image6.jpg",
            "name": "Дом Ланиных, ул. Большая Советская, д. 27/20",
            "descr": "Дом купцов Ланиных не только является архитектурным памятником, но и символизирует процветание торговли и культурного разнообразия в историческом центре Смоленска. Его величественный фасад и изысканные детали напоминают о богатстве и роскоши, характерных для периода процветающей торговли и культурного обмена, который сформировал историческую сущность города."
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.053340007904794, 54.782582504378034]
            ]
        }
    }, {
        "type": "Feature",
        "properties": {
            "fid": "23",
            "id": null,
            "nn": 0.0,
            "name": "Фонтан на Блонье",
            "descr": "Начальная точка маршрута"
        },
        "geometry": {
            "type": "MultiPoint",
            "coordinates": [
                [32.046192684518076, 54.781427254178126]
            ]
        }
    }, { "type": "Feature", "properties": { "fid": "24", "id": null, "nn": 18.0, "img": "images/image63.jpg", "name": "Церковь Иоанна Богослова, 12 век", "descr": "Церковь Иоанна Богослова XII века — крестово-купольный, одноглавый и трехапсидный храм, близкий по типу церкви Петра и Павла. Первоначально здание отличалось выразительной пластикой фасадов, двухуступчатыми порталами, узкими окнами, создававшими ощущение высоты, и декоративными элементами — аркатурой, поребриком и рельефными крестами. Храм был окружен галереей и имел росписи на стенах. Сегодня сохранились лишь искаженные стены, лишенные большинства древних деталей." }, "geometry": { "type": "MultiPoint", "coordinates": [ [ 32.037849055548683, 54.790183020330083 ] ] } },
    { "type": "Feature", "properties": { "fid": "25", "id": null, "nn": 19.0,"img": "images/image62.jpg", "name": "Лютеранское кладбище", "descr": "Лютеранское кладбище на улице Бакунина в Смоленске возникло у «немецкой божницы» XII века рядом с храмом Иоанна Богослова. После похорон губернатора Казимира фон Аша в 1820 году его стали называть немецким. В 1950-х кладбище исчезло — рядом построили дома, надгробия разрушили. В 1990-х здесь хотели разбить сквер имени Пестеля, но задумка до сх пор не реализовалась. Сегодня от некрополя не осталось почти ничего." }, "geometry": { "type": "MultiPoint", "coordinates": [ [ 32.037864447909399, 54.788958278129584 ] ] } },
    { "type": "Feature", "properties": { "fid": "26", "id": null, "nn": 20.0,"img": "images/image64.jpg", "name": "Церковь Петра и Павла,  12 век", "descr": "Церковь Петра и Павла XII века — древнейший из сохранившихся храмов Смоленска, построенный при князе Ростиславе Мстиславиче. Этот крестово-купольный памятник, переживший польскую оккупацию, пожары 1812 года, закрытие после революции и разрушения войны, был восстановлен в 1960-х годах архитектором П.Д. Барановским. Сегодня храм поражает строгой монументальностью, изяществом деталей и редким 12-гранным барабаном." }, "geometry": { "type": "MultiPoint", "coordinates": [ [ 32.037719323388778, 54.796388324987035 ] ] } },
    { "type": "Feature", "properties": { "fid": "27", "id": null, "nn": 21.0, "img": "images/image65.jpeg", "name": "Комплекс зданий завода \"Бахус\", пер. Карачевский, д.4", "descr": "Завод, открытый в 1865 году как первое в губернии винокуренное предприятие, стал важным промышленным объектом своего времени. Архитектурный ансамбль в стиле эклектики сочетает строгие формы с декоративными элементами, отражая тенденции второй половины XIX века. После периода упадка и заброшенности комплекс был полностью реставрирован и преобразован в современный индустриальный парк, где сохранили исторический облик зданий, наполнив их новыми функциями для бизнеса." }, "geometry": { "type": "MultiPoint", "coordinates": [ [ 32.02771272844943, 54.795080753665381 ] ] } }]
}
